package com.example.x.data.repository

import com.example.x.data.model.Course
import com.example.x.data.model.Event
import com.example.x.data.model.Lab
import com.example.x.data.model.User

object MockData {
    val user = User(
        id = "1",
        name = "Иванов Иван Иванович",
        group = "ИБ-21",
        faculty = "ИФН",
        avatarUrl = null
    )

    val courses = listOf(
        Course(1,"Информатика","Экзамен","2023 - 2024",108,"01-09-2023 31-12-2023","Илькевич В.В.",32,"9736"),
        Course(2,"Математический анализ","Зачет","2023 - 2024",72,"01-09-2023 31-12-2023","Петрова А.А.",28,"9737"),
        Course(3,"Физика","Экзамен","2024 - 2025",108,"01-09-2024 31-12-2024","Сидоров И.П.",40,"9738"),
        Course(4,"Программирование","Курсовая","2024 - 2025",144,"01-02-2025 31-05-2025","Козлов Д.С.",45,"9739"),
    )
    val labs = listOf(
        Lab("l1","Информатика","Лаб. №1 - Алгоритмы","2026-09-28","В работе", 5),
        Lab("l2","Информатика","Лаб. №2 - БД","2026-09-29","В работе", 0),
        Lab("l3","Физика","Лаб. №3 - Оптика","2026-10-05","Сдано", 10),
        Lab("l4","Программирование","Курсовой проект","2026-10-01","В работе", 2),
    )
    val events = listOf(
        Event("Информатика","Консультация перед экзаменом","15-12-2023"),
        Event("Физика","Лабораторная защита","20-12-2023")
    )
}
